/*
0. Напишите программу, которая на вход принимает число и выдаёт его квадрат 
(число умноженное на само себя).
*/

System.Console.WriteLine("Введите число");
int N = Convert.ToInt32(Console.ReadLine());
System.Console.WriteLine(N*N+$" квадрат числа {N}");